http://www.uni-protvino.ru/images/publications/ump_it/IT_EM_20.pdf

# Задачи на контейнеры

1. Дан `deque` D с четным количеством элементов. Вставить перед каждым элементом из первой половины исходного дека число `−1`. Использовать функцию-член `insert()` в цикле с числовым параметром.
   
2. Даны `list` L и `вектор` V; список L имеет нечетное количество элементов. Переместить средний элемент списка L в конец вектора V. Использовать функции-члены `push_back()` и `erase()`.
   
3. Дан `list` L с элементами `A1, A2, A3, …, A{N−1}, AN` (N – четное). Изменить порядок элементов в списке на следующий: `AN, A1, A{N−1}, A2, A{N−2}, …, A{N/2}, A{N/2 −1}`. Для этого использовать два итератора `i` и `r`, связав их с первым и последним элементом списка. В цикле, который должен повторяться `N/2` раз, вызывать функцию-член `splice()` с первым параметром `i++` и третьим параметром `r--`.

```c++
#include <iostream>
#include <list>

using std::cout;
using std::endl;
using std::list;

int main() {
  list<int> l1 = {1, 2, 3};

  list<int> l2 = {4, 5};

  l1.splice(l1.end(), l2, l2.begin());

  cout << "Contents of list l1 after splice operation" << endl;

  for (auto it = l1.begin(); it != l1.end(); ++it)
    cout << *it << endl;

  return 0;
}
```

4. Дан `deque` D. Удалить последний нулевой элемент дека. Если нулевых элементов нет, то дек не изменять. Использовать алгоритм `find()` с обратными итераторами и функцию-член `erase()`.

5. Запросить у пользователя произвольное количество чисел (считать, что пользователь больше не хочет вводить числа если он ввел `0`). Вывести на экран сначала положительные числа, а потом отрицательные.

6. Написать программу, добавляющую в конец списка вещественных чисел элемент, значение которого равно среднему арифметическому всех элементов списка. Результат вывести на экран.

7. Описать класс «студент» с полями: имя, фамилия, курс. Выполнить следующие действия: 
   
   * Переопределить у этого класса оператор вывода в поток. 
   
   * Написать функцию заполнения вектора из класса «студент» произвольными данными (10 записей). 
   
   * Написать функцию печати содержимого вектора. 
   
   * Отсортировать вектор по именам студентов по возрастанию (стабильная сортировка). 
   
   * Отсортировать вектор по фамилиям студентов по убыванию. 
   
   * Поместить в первые семь элементов вектора студентов самых младших курсов, в рамках одного курса упорядочить по фамилии в возрастающем порядке
  
   * После каждой операции выводить список студентов